ЛИС2/src/Documents/лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе/лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

ЛИС2/src/InformationRegisters/лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе/лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе</name>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтбора</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Компонент</name>
    <type>
      <types>CatalogRef.лис_КомпонентыЗамеровЛаборатории</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемПробы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </resources>
  <resources>
    <name>Методика</name>
    <type>
      <types>CatalogRef.МетодикиОпределенияИзмеренияАнализа</types>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказаниеПрибора5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднееЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СодержаниеПоРасчету</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АктОтбора</name>
    <type>
      <types>DocumentRef.лис_АктОтбораПроб</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаОтбораПробы</name>
    <type>
      <types>CatalogRef.ТочкиКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОпределяемыйПоказатель</name>
    <type>
      <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
      <types>CatalogRef.ЗВВода</types>
      <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
      <types>CatalogRef.ФакторыФизическогоВоздействия</types>
      <types>CatalogRef.ЗВАтмосфера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШифрПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/Documents/лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе/ManagerModule.bsl
Функция ПечатьЖурналОпределенияКомпонентовВАтмосферномВоздухе(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе_ЖурналОпределенияКомпонентовВАтмосферномВоздухе";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе.ПФ_MXL_ЖурналОпределенияКомпонентовВАтмосферномВоздухе");
		
	Для каждого ТекущийОбъект из МассивОбъектов Цикл
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// Шапка
		Область = Макет.ПолучитьОбласть("ОбластьШапка");
		ТабличныйДокумент.Вывести(Область);
		
		НЗ = РегистрыСведений.лис_ЖурналОпределенияКомпонентовВАтмосферномВоздухе.СоздатьНаборЗаписей();
		НЗ.Отбор.Документ.Установить(ТекущийОбъект);
		НЗ.Прочитать();
		
		
		// Строки
		Для каждого Проба из НЗ Цикл
			
			Область = Макет.ПолучитьОбласть("ОбластьСтрока");
			Область.Параметры.Заполнить(Проба);
			ТабличныйДокумент.Вывести(Область);
			
		КонецЦикла;
		
	    // Подвал
		Область = Макет.ПолучитьОбласть("ОбластьПодвал");
		Область.Параметры.Ответственный = ТекущийОбъект.Ответственный;
		ТабличныйДокумент.Вывести(Область);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции	

// Формирует печатные формы
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖурналОпределенияКомпонентовВАтмосферномВоздухе") Тогда 
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЖурналОпределенияКомпонентовВАтмосферномВоздухе", "Журнал определения компонентов в атмосферном воздухе",
			ПечатьЖурналОпределенияКомпонентовВАтмосферномВоздухе(МассивОбъектов, ОбъектыПечати),, "Документ.лис_ЖурналОпределенияКомпонентовВВоде.ПФ_MXL_ЖурналОпределенияКомпонентовВАтмосферномВоздухе");
			
	КонецЕсли; 
	
КонецПроцедуры
